export const tasks = [
  {
    id: 1,
    taskTitle: "القيام بمئة آية",
    mainText: "صلي كل ليلة ركعتين قيام الليل بمئة آية، فإن وافقت صلاتك ليلة القدر كتبت عند الله تعالى من القانتين يومياً لمدة 84 سنة.",
    subText: "لقول النبي ﷺ: (من قام بعشر آيات لم يكتب من الغافلين، ومن قام بمئة آية كتب من القانتين، ومن قام بألف آية كتب من المقنطرين). أخرجه أبو داود",
    options: [
      "10 آيات = سورة الإخلاص ثلاث مرات.",
      "100 آية = سورة الواقعة وسورة الإخلاص.",
      "1000 آية = الأجزاء 29 و 30."
    ],
    targetCounter: 1,
    buttonText: "تم"
  },
  {
    id: 2,
    taskTitle: "سورة الإخلاص",
    mainText: "اقرأ كل ليلة سورة الإخلاص 3 مرات فإن وافقت قراءتك ليلة القدر كنت كمن قرأ القرآن الكريم كاملاً يومياً لمدة 84 سنة.",
    subText: "وعن أبي هريرة رضي الله عنه أن رسول الله ﷺ قال في {قُلْ هُوَ اللَّهُ أَحَدٌ} إِنَّهَا تَعْدِلُ ثُلُثَ الْقُرْآنِ.\nرواه مسلم",
    targetCounter: 3,
    buttonText: "تم"
  },
  {
    id: 3,
    taskTitle: "التهليل",
    mainText: "قل: (لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير) 100 مرة.\nفإن وافقت ليلة القدر كنت كمن أعتق 300000 ألف رقبة، والرقبة الواحدة تعتق من النار.",
    subText: "من قال في يوم مئة مرة: (لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، وهو على كل شيء قدير).\nكانت له عدل عشر رقاب -يعني: عدل عشر رقاب يعتقها وكتب الله له مئة حسنة، ومحا عنه مئة سيئة، وكان في حرز من الشيطان في يومه ذلك حتى يمسي، ولم يأتِ أحد بأفضل مما جاء به، إلا رجل عمل أكثر من عمله.",
    targetCounter: 100,
    buttonText: "تم"
  },
  {
    id: 4,
    taskTitle: "خواتيم سورة البقرة",
    mainText: "قراءة خواتيم سورة البقرة (ءامن الرسول بما أنزل إليه من ربه..) فإن وافقت ليلة القدر، فقد كتب لك قيام 30000 ثلاثين ألف ليلة.\n\n﴿آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ (285) لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ (286)﴾",
    subText: "وعن أبي مسعود البدري رضي الله عنه عن النبي ﷺ قال: (من قرأ بالآيتين من آخر سورة البقرة في ليلة كفتاه).\nمتفق عليه\nقيل كفتاه أي: قيام الليل",
    targetCounter: 1,
    buttonText: "تم"
  },
  {
    id: 5,
    taskTitle: "التسبيح",
    mainText: "قل: (سبحان الله) 100 مرة\nفإن وافقت ليلة القدر يكتب لك 30,000,000 ثلاثين مليون حسنة، أو تحط عنك ثلاثين مليون خطيئة.",
    subText: "قال رسول الله صلى الله عليه وسلم: (أيعجز أحدكم أن يكسب كل يوم ألف حسنة؟ فسأله سائل من جلسائه: كيف يكسب أحدنا ألف حسنة؟ قال: يسبح مائة تسبيحة، فيكتب له ألف حسنة، أو يحط عنه ألف خطيئة).\nصحيح مسلم",
    targetCounter: 100,
    buttonText: "تم"
  },
  {
    id: 6,
    taskTitle: "صدقة يومية",
    mainText: "تصدق كل ليلة بالذي تستطيع من مال فإن وافقت ليلة القدر كنت كمن تصدق يومياً لمدة 84 سنة.",
    targetCounter: 1,
    buttonText: "تم"
  },
  {
    id: 7,
    taskTitle: "التسبيح والتحميد المضاعف",
    mainText: "قل:\nسبحان الله عدد ما خلق، سبحان الله ملء ما خلق.\nسبحان الله عدد ما في الأرض والسماء، سبحان الله ملء ما في الأرض والسماء.\nسبحان الله عدد ما أحصى كتابه، سبحان الله ملء ما أحصى كتابه.\nسبحان الله عدد كل شيء، سبحان الله ملء كل شيء.\nالحمد لله عدد ما خلق، الحمد لله ملء ما خلق.\nالحمد لله عدد ما في الأرض والسماء، الحمد لله ملء ما في الأرض والسماء.\nالحمد لله عدد ما أحصى كتابه، الحمد لله ملء ما أحصى كتابه.\nالحمد لله عدد كل شيء، الحمد لله ملء كل شيء.",
    targetCounter: 1,
    buttonText: "تم"
  },
  {
    id: 8,
    taskTitle: "سبحان الله العظيم وبحمده",
    mainText: "قل: (سبحان الله العظيم وبحمده) 100 مرة\nفإن وافقت ليلة القدر يكتب لك 3,000,000 ثلاثة ملايين نخلة في الجنة.",
    subText: "وعن جابر رضي الله عنه ، عن النبي ﷺ قال: (مَنْ قَالَ: سُبْحَانَ اللهِ الْعَظِيمِ وَبِحَمْدِهِ، غُرِسَتْ لَهُ نَخْلَةٌ فِي الْجَنَّةِ).\nرواه الترمذي",
    targetCounter: 100,
    buttonText: "تم"
  }
];
